# Project 2 Part 2

**Student:** Matthew Malueg

## Movies DataBase ERD

![Movies ERD](Data/Movies-ERD.png)

# Database preparation

## Loading data and imports

In [1]:
import pymysql
import pandas as pd
from urllib.parse import quote_plus
from sqlalchemy.types import *
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()

In [2]:
# Load movie titles
title_basics = pd.read_csv('Data/movie_basics.csv')

In [3]:
# Load movie ratings
ratings = pd.read_csv('Data/movie_ratings.csv')

## Examine data for Database construction

**Movie Titles**

In [4]:
title_basics.info()
title_basics.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86979 non-null  int64
 1   tconst          86979 non-null  object
 2   titleType       86979 non-null  object
 3   primaryTitle    86979 non-null  object
 4   originalTitle   86979 non-null  object
 5   isAdult         86979 non-null  int64
 6   startYear       86979 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86979 non-null  int64
 9   genres          86979 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [5]:
# Calculate max string len for object cols
tconst_length = title_basics['tconst'].fillna('').map(len).max()
tconst_length

10

In [6]:
# Calculate max string len for object cols
ptitle_length = title_basics['primaryTitle'].fillna('').map(len).max()
ptitle_length

242

**Movie Ratings**

In [7]:
ratings.info()
ratings.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     71900 non-null  int64
 1   tconst         71900 non-null  object
 2   averageRating  71900 non-null  float64
 3   numVotes       71900 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.2+ MB

   Unnamed: 0     tconst  averageRating  numVotes
0       17961  tt0035423            6.4     87153
1       40764  tt0062336            6.4       175
2       46645  tt0069049            6.7      7754
3       63640  tt0088751            5.2       336
4       69953  tt0096056            5.6       846

## Creating the database

**Create engine and connect Python and MySQL**

In [8]:
connection_str = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection_str)

In [9]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [10]:
conn = engine.connect()

### Inspect and prepare dataframes and tables

**Verify tables are present**

In [11]:
q = """SHOW TABLES"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

**Run DESCRIBE for each table and prepare dataframes for database**

In [12]:
# DESCRIBE title_basics
q = """DESCRIBE title_basics;"""
pd.read_sql(q, conn)

            Field          Type Null  Key Default Extra
0          tconst   varchar(10)   NO  PRI    None
1   primary_title  varchar(242)  YES         None
2      start_year         float  YES         None
3         runtime           int  YES         None
4  ratings_tconst   varchar(10)   NO  PRI    None

In [13]:
# Prepare title_basics dataframe for the database
tb_dtypes_dict = {'tconst': VARCHAR(10),
                  'primary_title': VARCHAR(242),
                  'start_year': FLOAT(),
                  'runtime': INTEGER(),
                  'ratings_tconst': VARCHAR(10)}

In [14]:
# DESCRIBE ratings
q = """DESCRIBE ratings;"""
pd.read_sql(q, conn)

             Field         Type Null  Key Default Extra
0           tconst  varchar(10)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [15]:
# Prepare ratings dataframe for the database
r_dtypes_dict = {'tconst': VARCHAR(10),
                 'average_rating': FLOAT(),
                 'number_of_votes': INTEGER()}

In [16]:
# DESCRIBE genres
q = """DESCRIBE genres;"""
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [17]:
# DESCRIBE title_genres
q = """DESCRIBE title_genres;"""
pd.read_sql(q, conn)

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

### Add dataframes to database

In [20]:
# Add title_basics to database
title_basics.to_sql('title_basics', conn, dtype = tb_dtypes_dict, if_exists='replace', index=False)

86979

In [21]:
# Add ratings to database
ratings.to_sql('ratings', conn, dtype = r_dtypes_dict, if_exists='replace', index=False)

71900

## Confirm construction of database

In [24]:
# Verify presence and names of tables
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

### Inspect each table

**genres**

In [25]:
q = """DESCRIBE genres;"""
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [26]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

**title_genres**

In [27]:
q = """DESCRIBE title_genres;"""
pd.read_sql(q, conn)

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [28]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

**title_basics**

In [29]:
q = """DESCRIBE title_basics;"""
pd.read_sql(q, conn)

            Field         Type Null Key Default Extra
0      Unnamed: 0       bigint  YES        None
1          tconst  varchar(10)  YES        None
2       titleType         text  YES        None
3    primaryTitle         text  YES        None
4   originalTitle         text  YES        None
5         isAdult       bigint  YES        None
6       startYear       double  YES        None
7         endYear       double  YES        None
8  runtimeMinutes       bigint  YES        None
9          genres         text  YES        None

In [30]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, conn)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,None,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,None,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,None,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,None,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,None,126,Drama

**ratings**

In [31]:
q = """DESCRIBE ratings;"""
pd.read_sql(q, conn)

           Field         Type Null Key Default Extra
0     Unnamed: 0       bigint  YES        None
1         tconst  varchar(10)  YES        None
2  averageRating       double  YES        None
3       numVotes       bigint  YES        None

In [32]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, conn)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,None,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,None,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,None,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,None,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,None,126,Drama